/**从文件提取的预定义的MartialID 列表*/
export const ExtractDefineMartialIDList = [
    "style_biojutsu"              , // 生化格斗术 一种后现代的先进格斗术，简称"生化术"。生化格斗术将武器、护甲和其它生化插件结合，产生了这种统一的武术流派。
    "style_centipede"             , // 蜈蚣功 五毒教汤山魁使用的神功。蜈蚣功用暴雨般的高频攻击敌人。你的每次命中都会提高你的攻击速度。暴击将进一步提高你的伤害。
    "style_lizard"                , // 壁虎功 五毒教何远新使用的神功。壁虎功善于利用墙壁攻击敌人。站在墙边可以获得更强的增益并解锁更强大的招式。
    "style_scorpion"              , // 蝎子功 五毒教马腾使用的神功。神秘的蝎子功主练"钳形散手"与"蝎尾踢"。保持移动可以解锁一招能击昏敌人的"巨螯击"，暴击时招式能造成更高伤害，并能够击飞对手和其它被撞到的人。
    "style_toad"                  , // 蛤蟆功 五毒教李豪使用的神功。蛤蟆功大师能专注于力量来抵御所有攻击。你有强大的物理防护，但当你移动时你会分心。你可以停下来冥想，在短时间内给自己提供更多的护甲。
    "style_venom_snake"           , // 毒蛇功 五毒教洪文通使用的神功，毒蛇功专注于攻击被击昏的对手。先用"蛇嘴拳"击晕，然后就能够使用传说中的"蛇信掌"终结对手。
    "MARTIAL_ARTS4"               , // 五毒门徒 你是五毒教的徒众。你在游戏开始时可以使用蜈蚣功，毒蛇功，蝎子功，壁虎功或蛤蟆功之一。请参考邵氏经典电影《五毒》。
    "tec_biojutsu_disarm"         , // 缴械
    "tec_biojutsu_strike_melee"   , // 精准打击（近战）
    "tec_biojutsu_strike_unarmed" , // 精准打击（徒手）
    "tec_biojutsu_impale"         , // 生化穿刺
    "tec_biojutsu_takedown"       , // 生化绊摔
    "tec_biojutsu_wide"           , // 生化斩击
    "tec_lizard_rapid"            , // 壁虎重击
    "tec_lizard_tail"             , // 壁虎扫尾
    "tec_lizard_break"            , // 反擒拿
    "tec_lizard_walldive"         , // 壁虎墙扑
    "tec_venom_snake_feint"       , // 毒蛇吐信
    "tec_venom_snake_rapid"       , // 蛇头拳
    "tec_venom_snake_bite"        , // 蛇嘴拳
    "tec_venom_snake_tail"        , // 毒蛇摆尾
    "tec_venom_snake_strike"      , // 蛇信掌
    "tec_scorpion_roundhouse"     , // 回旋踢
    "tec_scorpion_brutal"         , // 蝎尾踢
    "tec_scorpion_precise"        , // 巨螯击
    "tec_toad_cross"              , // 蛤蟆掴
    "tec_toad_crit"               , // 蛤蟆撞
    "tec_toad_grab"               , // 毒蟾吐舌
    "tec_centipede_break"         , // 反擒拿
    "tec_centipede_rapid"         , // 蜈蚣连击
    "tec_centipede_bite"          , // 蜈蚣撕咬
    "tec_centipede_disarm"        , // 缴械
    "style_none"                  , // 无流派 并非武术流派，而是人类近乎本能的拳脚击打。
    "style_kicks"                 , // 强制徒手 并非一种真正的武术流派，选择该流派将不使用手持物品近战攻击，而是用拳头（如果你空手时）或脚。
    "style_aikido"                , // 合气道 合气道是一种专注自卫的日本武术，以抓筋拿脉，分筋错骨为主要手段，尽量减少对对方的实际伤害。它使用防御投技并解除敌人的武装，但是招式缺乏进攻力。
    "style_bojutsu"               , // 日本棍术 日本棍术，又称"棍之道"，是一种源自日本的使用棍棒作战的武术。日本棍术专注于保持良好的姿态，以有效格挡和反击敌人。
    "style_barbaran"              , // 巴巴兰重剑术 巴巴兰重剑术起源于16世纪的西班牙，专注于对抗厚重装甲，使用重型武器和横扫招式来将动能透过装甲转移到脆弱的器官和骨骼上。
    "style_boxing"                , // 拳击 真正绅士的运动，现代拳击由维多利亚时期的拳击赛发展而来。力量能够增加格挡值，移动能够增加闪避技能。
    "style_brawling"              , // 斗殴技 你习惯于和各种生物打架，大概知道该如何徒手或使用武器攻击。你的招式看起来不是很美观，但是够用就行了。
    "style_capoeira"              , // 巴西战舞 巴西战舞是一种发源于巴西奴隶中的舞蹈般的武术，专注于流畅的动作和扫腿攻击。移动后的短时间内能使用更强力的招式，而没打中的时候能够在短时间内提高伤害。
    "style_crane"                 , // 鹤形拳 少林五形拳之一。鹤拳刚柔相济，拳意轻灵。敏捷将取代力量决定你的伤害，你有更高的闪避几率，闪避后可以在短时间内解锁威力强大的招式。
    "style_dragon"                , // 龙形拳 少林五形拳之一。龙拳步法多变，攻击凶悍。智力将替代敏捷及力量提升你的命中和伤害。闪避和格挡也会增加你的伤害。原地等待会增加你的防御能力。你可以对被击倒的对手进行强力打击。
    "style_eskrima"               , // 菲律宾剑棍术 菲律宾剑棍术，同时以"卡力"一名闻名，是一种源自菲律宾的武术。它的招式侧重于使用匕首、短棍和各类自制武器快速连续的攻击，因手上武器不同，可以有各种变招。
    "style_fencing"               , // 击剑 击剑术，一种高雅的武艺，通过灵活的比赛用剑施展，但是这些招式是从多种不同的武器的使用中总结提取出来的，所以也适用于使用其他武器战斗。资深的击剑者能够在格挡和佯攻寻求精准突刺的机会。
    "style_medievalpole"          , // 战斗之花 中世纪欧洲使用钩式武器战斗的武术招式。 "战斗之花"非常注重反击对手并在致命一击之前将其击倒。
    "style_judo"                  , // 柔道 柔道是一种侧重于抓取并抛出武术，兼具防守与进攻。大多数能让你摔倒的攻击都能被你抵挡下来，并且能用强大的柔道投掷术来打断那些想要抓住或者想要击倒你的攻击。
    "style_karate"                , // 空手道 空手道是一种广为流行的武术，起源于日本。它侧重于快速、精确的攻击、格挡和流畅的步法。成功命中会让你在下回合获得额外闪避和额外格挡。
    "style_kickboxing"            , // 踢拳道 一种将西方拳击与空手道、跆拳道、泰拳和法国踢腿术元素相结合的武术，侧重于踢腿的技巧。美式踢拳道去掉了膝顶和肘击，转而专注于高踢。
    "style_krav_maga"             , // 马伽术 发源于以色列地区，马伽术基于迅速有效地打倒敌人的技巧发展而来。它的技术偏向于切实有效的攻击动作，摒弃展示用或者较为复杂的动作。在警察和各种武装部队人员之间流行。
    "style_leopard"               , // 豹形拳 少林五形拳之一。豹拳出其不意，快速压制。敏捷将替代力量提升你的伤害，同时能提高暴击率。
    "style_swordsmanship"         , // 中世纪剑术 使用长剑和剑与盾的技艺，这一技艺之后发展成了现代击剑。它既适用于无甲战斗，也适用于装甲战斗，包括擒拿以及防守和进攻剑法。这篇论文用详尽的分解插图比较了意大利和德国的中世纪战斗传统。
    "style_muay_thai"             , // 泰拳 也被称作"八臂武术"，泰拳是一种源自泰国的流行格斗技，采用双拳、双肘、双膝、双脚这八个部位给予对手强力一击。你的格挡值随着力量增加而增加。格挡成功或者受到伤害会增加你的攻击伤害并提升后续格挡值。
    "style_ninjutsu"              , // 忍术 忍术是封建时代的日本忍者所使用的武学和战斗技巧。它专注于快速、精确、无声的突击。忍术招式几乎全是无声的，并且首次攻击时有暴击几率更高。它也会在你每次移动时提供少许战斗加成。
    "style_niten"                 , // 二天一流 名为二天一流的二刀流流派，是一个由传奇的日本剑术名家宫本武藏所创立的流派。感知提升攻击伤害和格挡值。每次移动和攻击都会降低闪避和攻击伤害，除非你在每次攻击前停顿一下。原地不动时可以提升闪避技能。
    "style_pankration"            , // 古希腊搏击 一种曾经由斯巴达人使用过的古希腊武术，结合拳击和摔跤技巧，构筑成一个残酷的运动。而现代的版本就有着某些规范了。
    "style_silat"                 , // 班卡苏拉刀术 班卡苏拉，这种武术发源于印尼，是一种使用短刀和棍棒来格斗的武术流派。武者弯腰游走来回避攻击，然后出其不意的发动致命的会心一击。
    "style_snake"                 , // 蛇形拳 少林五形拳之一。蛇拳以其若即若离的进攻动作与精准而致命的打击闻名于世。感知将取代敏捷和力量决定命中和伤害，且静止不动会提升下次攻击时的命中和暴击几率。
    "style_sojutsu"               , // 日本枪术 日本枪术是一种源自日本的使用长矛作战的武术。日本枪术专注于在战斗中保持同对手的距离，以便维持自身战斗优势。当你站立不动时，你会获得一次额外的格挡，而你移动时则会短暂地提高伤害。
    "style_taekwondo"             , // 跆拳道 跆拳道是韩国的国民运动项目，也在20世纪时被韩国军队使用。由于这种武术流派专注于使用脚踢攻击对手，因此它不受你手中武器的加成。这项武术流派同时也包含了力量的训练；格挡将吸收更多伤害，并且未手持物品时你的伤害也会增加。
    "style_tai_chi"               , // 太极 尽管太极通常被视为一种锻炼身心的运动，它同时也是一种专注于自卫的正规武术。太极能够吸收攻击的力量，使你在格挡时所受伤害随着感知的提高而进一步减小。原地不动时，你可以使出强力的掌击。
    "style_tiger"                 , // 虎形拳 少林五形拳之一。虎拳一气相贯，连绵不绝。力量将取代敏捷决定你的命中，且连续攻击将逐步增加伤害。
    "style_wingchun"              , // 咏春 咏春是一门中国武术，传说起源于南少林鹤拳，也有从蛇鹤相斗获得灵感的说法。它的站立姿势很高，重心完全放在后腿上。咏春专注于对对手发力方向的准确感知，并借此还击。
    "style_zui_quan"              , // 醉拳 醉拳模仿醉汉的动作来迷惑敌人。你获得基于智力的被动闪避加成及闪避次数加成。闪避成功会在短时间内让你获得基于智力的伤害和命中。移动会给你额外的闪避加成。
    "style_debug"                 , // 调试专精 失传的绝世武学，仅由开发者和作弊者使用。
] as const;
/**从文件提取的预定义的MartialID */
export type ExtractDefineMartialID = typeof ExtractDefineMartialIDList[number];